<?php
function getPronuNum($pronu)
{
    $pronuArray0 = array("ア","カ","サ","タ","ナ","ハ","マ","ヤ","ラ","ワ","イ","キ","シ","チ","ニ","ヒ","ミ","","リ","ヲ","ウ"
    ,"ク","ス","ツ","ヌ","フ","ム","ユ","ル","ン","エ","ケ","セ","テ","ネ","ヘ","メ","","レ","","オ","コ","ソ","ト","ノ","ホ","モ"
    ,"ヨ","ロ","麿");

    $pronuArray = array("あ","か","さ","た","な","は","ま","や","ら","わ","い","き","し","ち","に","ひ","み","  ","り","を","う"
    ,"く","す","つ","ぬ","ふ","む","ゆ","る","ん","え","け","せ","て","ね","へ","め","  ","れ","  ","お","こ","そ","と","の","ほ"
    ,"も","よ","ろ","麿");
    for ($i = 0; $i< 50; $i++)
    {
        if ($i != 17 && $i != 37 && $i != 39 && 0 === strpos($pronu, $pronuArray[$i]))
        {
            return $i;
        }
    }

    for ($i = 0; $i< 50; $i++)
    {
        if ($i != 17 && $i != 37 && $i != 39 && 0 === strpos($pronu, $pronuArray0[$i]))
        {
            return $i;
        }
    }

    return 49;
}
?>
